In [1]:
import pandas as pd

In [5]:
df = pd.read_csv('tweets_milestones.csv')
df.head()

                    id     user_id     to_date
0  1016491072090976256    27823262  2018-07-10
1  1016492014744014848    27823262  2018-07-10
2  1016658957505630208  2815413319  2018-07-10
3  1037128173882941440   143196450  2018-09-05
4  1037146029878136832    21584887  2018-09-05

In [11]:
df_names = pd.read_csv('all_tweets_keywords.csv')
df_names = df_names[['user_id', 'user_name']].drop_duplicates()
df_names.head()

      user_id      user_name
0    27823262     donkolenda
2  2815413319  joselouis4077
4   200250384  rexfordimages
5   119216114     pwrmaster7
6    40661306       druneric

In [7]:
df['to_date'].unique()

array(['2018-07-10', '2018-09-05', '2018-09-24', '2018-09-27',
       '2018-10-06'], dtype=object)

In [24]:
df_group = pd.DataFrame(df['user_id'].value_counts()).reset_index().rename({'index':'user_id',
                                                                            'user_id':'baseline'}, axis=1)
df_baseline = pd.merge(df_group, df_names, on='user_id')
df_baseline = df_baseline[['user_name', 'baseline']]
df_baseline.head()

        user_name  baseline
0      lamaritzam        28
1  PortCityPisces        26
2   aletweetsnews        19
3       moraro456        17
4    EarlPdxPearl         8

In [25]:
df_baseline.to_csv('base_line.csv', index=False)